**Adding the data to the correct Tables**

In [39]:
%load_ext sql
%sql sqlite:///CourseData.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @CourseData.db'

In [40]:
%%sql
INSERT INTO INSTRUCTOR (primary_instructor)
SELECT DISTINCT primary_instructor
FROM import_courses;

 * sqlite:///CourseData.db
1105 rows affected.

[]

In [41]:
%%sql
INSERT INTO CATALOG_DESC (catalog_id, program_code, program_name, course_title, credits, prereqs, coreqs, fees, attributes, description, catalog_year)
SELECT catalog_id, program_code, program_name, course_title, credits, prereqs, coreqs, fees, attributes, description, catalog_year
FROM import_catalogs;

 * sqlite:///CourseData.db
4441 rows affected.

[]

In [38]:
%%sql
INSERT INTO COURSE_OFFERING (CRN, term, section, title, credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id)
SELECT CRN, term, section, title, credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id
    FROM import_courses
    JOIN INSTRUCTOR ON (import_courses.primary_instructor=INSTRUCTOR.primary_instructor)
    JOIN CATALOG_DESC ON (import_courses.catalog_id=CATALOG_DESC.catalog_id);

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: num_credits [SQL: 'INSERT INTO COURSE_OFFERING (CRN, term, section, title, num_credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id)\nSELECT CRN, term, section, title, num_credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id\n    FROM import_courses\n    JOIN INSTRUCTOR ON (import_courses.primary_instructor=INSTRUCTOR.primary_instructor)\n    JOIN CATALOG_DESC ON (import_courses.catalog_id=CATALOG_DESC.catalog_id);'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [18]:
%%sql
SELECT *
FROM import_course_meetings
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00')]

In [19]:
%%sql
SELECT *
FROM import_courses
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', '0', '31', '-31'),
 ('Fall2014', '70385', 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', '0', '31', '-31')]

In [20]:
%%sql
INSERT INTO COURSE_MEETING (course_offering_id, location, day, start, end)
SELECT course_offering_id, location, day, start, end
    FROM import_course_meetings
    JOIN COURSE_OFFERING ON (import_course_meetings.CRN=COURSE_OFFERING.CRN AND import_course_meetings.term=COURSE_OFFERING.term);

 * sqlite:///CourseData.db
609894 rows affected.

[]

In [22]:
%%sql
SELECT location, day, CRN
FROM COURSE_MEETING
JOIN COURSE_OFFERING ON (COURSE_OFFERING.course_offering_id=COURSE_MEETING.course_offering_id)
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('DSB 105', 'T', '70384'),
 ('DSB 105', 'T', '70384'),
 ('DSB 105', 'F', '70384'),
 ('DSB 105', 'F', '70384'),
 ('DSB 105', 'T', '70384'),
 ('DSB 105', 'T', '70384'),
 ('DSB 105', 'F', '70384'),
 ('DSB 105', 'F', '70384'),
 ('DSB 105', 'T', '70384'),
 ('DSB 105', 'T', '70384')]

In [12]:
%%sql
SELECT COUNT(DISTINCT section), primary_instructor 
FROM COURSE_OFFERING 
WHERE term = 'Fall2018';

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: primary_instructor [SQL: "SELECT COUNT(DISTINCT section), primary_instructor \nFROM COURSE_OFFERING \nWHERE term = 'Fall2018';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [ ]:
%%sql
INSERT INTO COURSE_OFFERING (CRN, catalog_id, term, section, title, credits, cap, act, rem, meetings, timecodes, primary_instructor)
SELECT CRN, catalog_id, term, section, title, credits, cap, act, rem, meetings, timecodes, primary_instructor
FROM import_courses;